In [98]:
import pandas as pd
import seaborn as sns

In [99]:
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [100]:
dummy=pd.get_dummies(df["embarked"], drop_first=True, prefix="embarked",prefix_sep="-").astype("int64")
dummy

     embarked-Q  embarked-S
0             0           1
1             0           0
2             0           1
3             0           1
4             0           1
..          ...         ...
886           0           1
887           0           1
888           0           1
889           0           0
890           1           0

[891 rows x 2 columns]

In [101]:
dummy_val=pd.DataFrame(dummy)
dummy_val

     embarked-Q  embarked-S
0             0           1
1             0           0
2             0           1
3             0           1
4             0           1
..          ...         ...
886           0           1
887           0           1
888           0           1
889           0           0
890           1           0

[891 rows x 2 columns]

In [102]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [103]:
df.drop(["embarked"], axis=1,inplace=True)

In [104]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,Third,man,True,NaN,Southampton,no,True

In [105]:
new_df=pd.concat([df,dummy_val],axis=1)

In [106]:
new_df

,survived,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alive,alone,embarked-Q,embarked-S
0,0,3,male,22.0,1,0,7.2500,Third,man,True,NaN,Southampton,no,False,0,1
1,1,1,female,38.0,1,0,71.2833,First,woman,False,C,Cherbourg,yes,False,0,0
2,1,3,female,26.0,0,0,7.9250,Third,woman,False,NaN,Southampton,yes,True,0,1
3,1,1,female,35.0,1,0,53.1000,First,woman,False,C,Southampton,yes,False,0,1
4,0,3,male,35.0,0,0,8.0500,Third,man,True,NaN,Southampton,no,True,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,Second,man,True,NaN,Southampton,no,True,0,1
887,1,1,female,19.0,0,0,30.0000,First,woman,False,B,Southampton,yes,True,0,1
888,0,3,female,NaN,1,2,23.4500,Third,woman,False,NaN,Southampton,no,False,0,1
889,1,1,male,26.0,0,0,30.0000,First,man,True,C,Cherbourg,yes,True,0,0
890,0,3,male,32.0,0,0,7.7500,Third,man,True,NaN,Queenstown,no,True,1,0

In [107]:
from sklearn.preprocessing import OneHotEncoder
one_New=OneHotEncoder(sparse_output=False)

In [108]:
df["sex"]=one_New.fit_transform(df[["sex"]])

In [109]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,0.0,22.0,1,0,7.2500,Third,man,True,NaN,Southampton,no,False
1,1,1,1.0,38.0,1,0,71.2833,First,woman,False,C,Cherbourg,yes,False
2,1,3,1.0,26.0,0,0,7.9250,Third,woman,False,NaN,Southampton,yes,True
3,1,1,1.0,35.0,1,0,53.1000,First,woman,False,C,Southampton,yes,False
4,0,3,0.0,35.0,0,0,8.0500,Third,man,True,NaN,Southampton,no,True

In [110]:
df.dropna()

,survived,pclass,sex,age,sibsp,parch,fare,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,1.0,38.0,1,0,71.2833,First,woman,False,C,Cherbourg,yes,False
3,1,1,1.0,35.0,1,0,53.1000,First,woman,False,C,Southampton,yes,False
6,0,1,0.0,54.0,0,0,51.8625,First,man,True,E,Southampton,no,True
10,1,3,1.0,4.0,1,1,16.7000,Third,child,False,G,Southampton,yes,False
11,1,1,1.0,58.0,0,0,26.5500,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,1.0,47.0,1,1,52.5542,First,woman,False,D,Southampton,yes,False
872,0,1,0.0,33.0,0,0,5.0000,First,man,True,B,Southampton,no,True
879,1,1,1.0,56.0,0,1,83.1583,First,woman,False,C,Cherbourg,yes,False
887,1,1,1.0,19.0,0,0,30.0000,First,woman,False,B,Southampton,yes,True
889,1,1,0.0,26.0,0,0,30.0000,First,man,True,C,Cherbourg,yes,True

In [111]:
df["class"]=one_New.fit_transform(df[["class"]])

In [112]:
encode_data = one_New.fit_transform(df[["who"]])

In [113]:
df["who"].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

In [114]:
encode_data

array([[0., 1., 0.],
       [0., 0., 1.],
       [0., 0., 1.],
       ...,
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 1., 0.]], shape=(891, 3))

In [115]:
#encode_data=pd.DataFrame(encode_data, columns=one_New.get_feature_names_out(["who"]))

In [116]:
df1 = pd.DataFrame(encode_data, columns=one_New.get_feature_names_out(["who"]))

In [117]:
df1.head()

   who_child  who_man  who_woman
0        0.0      1.0        0.0
1        0.0      0.0        1.0
2        0.0      0.0        1.0
3        0.0      0.0        1.0
4        0.0      1.0        0.0

In [118]:
df=df.drop("who", axis=1)

In [119]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,class,adult_male,deck,embark_town,alive,alone
0,0,3,0.0,22.0,1,0,7.2500,0.0,True,NaN,Southampton,no,False
1,1,1,1.0,38.0,1,0,71.2833,1.0,False,C,Cherbourg,yes,False
2,1,3,1.0,26.0,0,0,7.9250,0.0,False,NaN,Southampton,yes,True
3,1,1,1.0,35.0,1,0,53.1000,1.0,False,C,Southampton,yes,False
4,0,3,0.0,35.0,0,0,8.0500,0.0,True,NaN,Southampton,no,True

In [120]:
df=pd.concat([df1,df], axis=1)

In [121]:
df.head()

,who_child,who_man,who_woman,survived,pclass,sex,age,sibsp,parch,fare,class,adult_male,deck,embark_town,alive,alone
0,0.0,1.0,0.0,0,3,0.0,22.0,1,0,7.2500,0.0,True,NaN,Southampton,no,False
1,0.0,0.0,1.0,1,1,1.0,38.0,1,0,71.2833,1.0,False,C,Cherbourg,yes,False
2,0.0,0.0,1.0,1,3,1.0,26.0,0,0,7.9250,0.0,False,NaN,Southampton,yes,True
3,0.0,0.0,1.0,1,1,1.0,35.0,1,0,53.1000,1.0,False,C,Southampton,yes,False
4,0.0,1.0,0.0,0,3,0.0,35.0,0,0,8.0500,0.0,True,NaN,Southampton,no,True